# Establish a connection between Python and the Sakila database.

In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()

········

In [5]:
user = 'root'  
host = 'localhost'  
database = 'sakila'  

connection_string = f"mysql+pymysql://{user}:{password}@{host}/{database}"

engine = create_engine(connection_string)

data = pd.read_sql_query('SELECT * FROM rental', engine)
display(data)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

In [6]:
data.shape

(16044, 7)

In [7]:
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

# Write a Python function called rentals_month

In [8]:
def rentals_month(engine, month, year):
    """
    Fetches rental data for a specific month and year from the Sakila database.
    
    Parameters:
    - engine: SQLAlchemy engine object for the database connection.
    - month: Integer representing the month.
    - year: Integer representing the year.
    
    Returns:
    - Pandas DataFrame containing rental data for the specified month and year.
    """
    
    query = f"""
    SELECT *
    FROM rental
    WHERE YEAR(rental_date) = {year} AND MONTH(rental_date) = {month}
    """
    
    data = pd.read_sql_query(query, engine)
    
    return data

# Develop a Python function called rental_count_month

In [9]:
def rental_count_month(df, month, year):
    """
    Returns a DataFrame containing the number of rentals made by each customer_id during the specified month and year.
    
    Parameters:
    - df: Pandas DataFrame containing rental data for the specified month and year (from the rentals_month function).
    - month: Integer representing the month.
    - year: Integer representing the year.
    
    Returns:
    - Pandas DataFrame with customer_id as index and number of rentals as values. Column name will be in the format "rentals_MM_YYYY".
    """
    
    rental_counts = df.groupby('customer_id').size()
    
    rental_counts.name = f'rentals_{month:02}_{year}'
    
    rental_counts_df = rental_counts.reset_index()
    
    return rental_counts_df

# Create a Python function called compare_rentals

In [ ]:
def compare_rentals(df1, df2):
    """
    Compares the number of rentals between two DataFrames and returns the difference.
    
    Parameters:
    - df1: Pandas DataFrame containing rental counts for the first month/year.
    - df2: Pandas DataFrame containing rental counts for the second month/year.
    
    Returns:
    - Pandas DataFrame with customer_id as index, columns from both input DataFrames, and a 'difference' column.
    """
    
    merged_df = pd.merge(df1, df2, on='customer_id', how='outer').fillna(0)
    
    column1, column2 = merged_df.columns[1], merged_df.columns[2]
    
    merged_df['difference'] = merged_df[column1] - merged_df[column2]
    
    return merged_df